In [1]:
a = 10
b = 0
c = a/b

ZeroDivisionError: division by zero

In [2]:
f = open('Finance_1','r')

FileNotFoundError: [Errno 2] No such file or directory: 'Finance_1'

In [6]:
try:
    f = open('Finance.csv','r')
    f.rwite('adjhfb')
except:
    print('File not found error occured')

File not found error occured

In [7]:
import os
os.listdir()

['.conda',
 '.condarc',
 '.continuum',
 '.idlerc',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.matplotlib',
 '12th sept (core python) day 3.ipynb',
 '15-09-2023.ipynb',
 '18-09-2023.ipynb',
 '1st.py',
 '21-09-2023.ipynb',
 '22-09-2023.ipynb',
 'AppData',
 'Application Data',
 'average marks.txt',
 'Average_Marks_shubham.txt',
 'Average_Marks_shubham1.txt',
 'Contacts',
 'Cookies',
 'Documents',
 'Downloads',
 'DS-16-09.ipynb',
 'DS-17-09.ipynb',
 'DS-23-09.ipynb',
 'Favorites',
 'introduction to python.ipynb',
 'Links',
 'Local Settings',
 'Microsoft',
 'Music',
 'My Documents',
 'NetHood',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{a832e014-6a45-11ed-86ee-c475ab738295}.TM.blf',
 'NTUSER.DAT{a832e014-6a45-11ed-86ee-c475ab738295}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{a832e014-6a45-11ed-86ee-c475ab738295}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'PrintHood',
 'PycharmProjects',
 'Python1stday (1).ipynb',
 'Python2ndday.ipynb',
 'python3rdclass.ipynb',
 'Python4thday.ipynb',
 'python5thday.ipynb',
 'python6thday.ipynb',
 'readme.txt',
 'Recent',
 'Saved Games',
 'Searches',
 'SendTo',
 'Start Menu',
 'Statistics.ipynb',
 'Templates',
 'Untitled.ipynb',
 'untitled.txt',
 'Untitled1.ipynb',
 'Untitled10.ipynb',
 'Untitled11.ipynb',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Untitled4.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'Untitled7.ipynb',
 'Untitled8.ipynb',
 'Untitled9.ipynb',
 'Videos']

In [9]:
f = open('Finance.csv','r')

FileNotFoundError: [Errno 2] No such file or directory: 'Finance.csv'

In [11]:
f = open('countries.csv','r')
f.readlines()

FileNotFoundError: [Errno 2] No such file or directory: 'countries.csv'

In [30]:
def tab(a):
    for i in range (0,10):
        multiply=a*(i)
        i = i + 1
    return i

In [29]:
tab(7)

7

In [33]:
for i in range(0,10):
    print(i*(i+1))
    i = i + 1

0
2
6
12
20
30
42
56
72
90

In [47]:
number = int(input("enter your number:"))

try 
for i in range(1, 11):
    result = number * i
    print(result)

enter your number:l

ValueError: invalid literal for int() with base 10: 'l'

In [45]:
# Get the user's input and convert it to an integer
number = int(input("Enter your number:"))

# Iterate through the numbers 1 to 10 and print the multiplication results
for i in range(1, 11):
    result = number * i
    print(result)

Enter your number:4
4
8
12
16
20
24
28
32
36
40

In [51]:
try:
    number = int(input("Enter your number:"))

    for i in range(1, 11):
        result = number * i
        print(result)
except ValueError:
    print("Please enter a valid number.")

Enter your number:okk
Please enter a valid number.

In [61]:
import pandas as pd

In [86]:
s = [21,22,23,24,25]

In [62]:
ser = pd.Series(s)

In [63]:
type(ser)

pandas.core.series.Series

In [66]:
ser

0    21
1    22
2    23
3    24
4    25
Name: age, dtype: int64

In [69]:
wei = [45,65,85,55,65]

In [71]:
wegt = pd.Series(wei)

In [72]:
ser + wegt

0     66
1     87
2    108
3     79
4     90
dtype: int64

In [73]:
ser > wegt

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [65]:
ser = pd.Series(s,name='age')

In [67]:
l1 = [5,4,6]
l2 = [0,1,2]

In [68]:
l1+l2

[5, 4, 6, 0, 1, 2]

In [77]:
ser.mean()

23.0

In [78]:
ser.median()

23.0

In [79]:
ser.mode()

0    21
1    22
2    23
3    24
4    25
Name: age, dtype: int64

In [80]:
ser[1]=50

In [81]:
ser

0    21
1    50
2    23
3    24
4    25
Name: age, dtype: int64

In [83]:
ser.count(50)

C:\Users\Shubh\AppData\Local\Temp\ipykernel_15756\3256712744.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. ser.count(level=1) should use ser.groupby(level=1).count().
  ser.count(50)

ValueError: Series.count level is only valid with a MultiIndex

In [87]:
ser.corr(wegt)

0.12025255493867838

In [75]:
round(wegt.mean(),2)

63.0

In [76]:
wegt.dtype

dtype('int64')

In [88]:
import pandas as pd

In [89]:
salaries_df = pd.read_csv(r"C:\Users\Shubh\Downloads\Salaries.csv")

In [92]:
salaries_df.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [93]:
salaries_df.tail(10)

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [94]:
salaries_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 78 entries, 0 to 77
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   rank        78 non-null     object
 1   discipline  78 non-null     object
 2   phd         78 non-null     int64
 3   service     78 non-null     int64
 4   sex         78 non-null     object
 5   salary      78 non-null     int64
dtypes: int64(3), object(3)
memory usage: 3.8+ KB

In [95]:
salaries_df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [104]:
salaries_df.loc[1,['phd','sex']]

phd      12
sex    Male
Name: 1, dtype: object

In [125]:
salaries_df.loc[[1,3,5,2,4,6]]['salary']

1     93000
3    131205
5    122400
2    110515
4    104800
6     81285
Name: salary, dtype: int64

In [108]:
df_descipline = salaries_df.iloc[0][1]

In [109]:
df_descipline

'B'

In [115]:
df_salary = salaries_df.iloc[0:20]['salary'].mean()

In [116]:
df_salary

117545.85

In [138]:
salaries_df[salaries_df['rank'].loc[0:]=='Prof'].max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [139]:
salaries_df[salaries_df['rank'].loc[0:]=='Prof'].mean()

C:\Users\Shubh\AppData\Local\Temp\ipykernel_15756\556664382.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  salaries_df[salaries_df['rank'].loc[0:]=='Prof'].mean()

phd            27.065217
service        21.413043
salary     123624.804348
dtype: float64

In [146]:
df_salary = salaries_df[salaries_df['sex']=='Male']

In [147]:
df_salary

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778
12   AsstProf          B    1        0  Male   88000
13       Prof          B   35       33  Male  162200
14       Prof          B   25       19  Male  153750
15       Prof          B   17        3  Male  150480
16   AsstProf          B    8        3  Male   75044
17   AsstProf          B    4        0  Male   92000
18       Prof          A   19        7  Male  107300
19       Prof          A   29       27  Male  150500
20   AsstProf          B    4        4  Male   92000
21       Prof          A   33       30  Male  103106
22   AsstProf          A    4        2  Male   73000
23   AsstProf          A    2        0  Male   85000
24       Prof          A   30       23  Male   91100
25       Prof          B   35       31  Male   99418
26       Prof          A   38       19  Male  148750
27       Prof          A   45       43  Male  155865
28   AsstProf          B    7        2  Male   91300
29       Prof          B   21       20  Male  123683
30  AssocProf          B    9        7  Male  107008
31       Prof          B   22       21  Male  155750
32       Prof          A   27       19  Male  103275
33       Prof          B   18       18  Male  120000
34  AssocProf          B   12        8  Male  119800
35       Prof          B   28       23  Male  126933
36       Prof          B   45       45  Male  146856
37       Prof          A   20        8  Male  102000
38   AsstProf          B    4        3  Male   91000

In [149]:
salaries_df = pd.read_csv(r"C:\Users\Shubh\Downloads\Salaries.csv")

In [150]:
train_df = pd.read_csv(r"C:\Users\Shubh\Downloads\train.csv")

In [151]:
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [156]:
mean_salary = salaries_df.groupby('rank')[['rank']].min()

In [157]:
mean_salary

                rank
rank
AssocProf  AssocProf
AsstProf    AsstProf
Prof            Prof

In [160]:
salaries_df.pivot(columns=['rank','discipline'])

             phd                                        service        \
rank        Prof       AssocProf AsstProf     AssocProf    Prof
discipline     B     A         A        B   A         B       B     A
0           56.0   NaN       NaN      NaN NaN       NaN    49.0   NaN
1            NaN  12.0       NaN      NaN NaN       NaN     NaN   6.0
2            NaN  23.0       NaN      NaN NaN       NaN     NaN  20.0
3            NaN  40.0       NaN      NaN NaN       NaN     NaN  31.0
4           20.0   NaN       NaN      NaN NaN       NaN    18.0   NaN
..           ...   ...       ...      ...  ..       ...     ...   ...
73          18.0   NaN       NaN      NaN NaN       NaN    10.0   NaN
74           NaN   NaN       NaN      NaN NaN      19.0     NaN   NaN
75          17.0   NaN       NaN      NaN NaN       NaN    17.0   NaN
76           NaN  28.0       NaN      NaN NaN       NaN     NaN  14.0
77           NaN  23.0       NaN      NaN NaN       NaN     NaN  15.0

                               ...       sex                          \
rank       AssocProf AsstProf  ... AssocProf AsstProf      AssocProf
discipline         A        B  ...         A        B    A         B
0                NaN      NaN  ...       NaN      NaN  NaN       NaN
1                NaN      NaN  ...       NaN      NaN  NaN       NaN
2                NaN      NaN  ...       NaN      NaN  NaN       NaN
3                NaN      NaN  ...       NaN      NaN  NaN       NaN
4                NaN      NaN  ...       NaN      NaN  NaN       NaN
..               ...      ...  ...       ...      ...  ...       ...
73               NaN      NaN  ...       NaN      NaN  NaN       NaN
74               NaN      NaN  ...       NaN      NaN  NaN    Female
75               NaN      NaN  ...       NaN      NaN  NaN       NaN
76               NaN      NaN  ...       NaN      NaN  NaN       NaN
77               NaN      NaN  ...       NaN      NaN  NaN       NaN

              salary
rank            Prof           AssocProf AsstProf     AssocProf
discipline         B         A         A        B   A         B
0           186960.0       NaN       NaN      NaN NaN       NaN
1                NaN   93000.0       NaN      NaN NaN       NaN
2                NaN  110515.0       NaN      NaN NaN       NaN
3                NaN  131205.0       NaN      NaN NaN       NaN
4           104800.0       NaN       NaN      NaN NaN       NaN
..               ...       ...       ...      ...  ..       ...
73          105450.0       NaN       NaN      NaN NaN       NaN
74               NaN       NaN       NaN      NaN NaN  104542.0
75          124312.0       NaN       NaN      NaN NaN       NaN
76               NaN  109954.0       NaN      NaN NaN       NaN
77               NaN  109646.0       NaN      NaN NaN       NaN

[78 rows x 24 columns]

In [162]:
salaries_df.pivot_table(values='salary',columns=['rank','discipline'])

rank       AssocProf            AsstProf                         Prof  \
discipline         A          B        A             B              A
salary       73959.8  102927.75  74450.0  86390.272727  111935.695652

rank
discipline              B
salary      135313.913043

In [164]:
salaries_df.pivot_table(values='salary',columns=['rank','discipline'],aggfunc='sum')

rank       AssocProf         AsstProf             Prof
discipline         A       B        A       B        A        B
salary        369799  823422   595600  950293  2574521  3112220

In [165]:
salaries_df.pivot_table(values='salary',columns=['rank','discipline'],aggfunc='median')

rank       AssocProf         AsstProf           Prof
discipline         A       B        A      B       A       B
salary         74830  104268    73250  91000  109646  129000

In [172]:
train_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [167]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [204]:
train_df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [196]:
x = train_df['Age'].mean()

In [185]:
x = train_df['Age'].mean()

In [186]:
x

29.69911764705882

In [187]:
train_df['Age'].interpolate(inplace=True)

In [189]:
train_df['Cabin'].bfill(inplace=True)

In [191]:
train_df['Cabin'].ffill(inplace=True)

In [203]:
train_df['Embarked'].interpolate(method = 'ffill',inplace = True)

In [209]:
train_df['Age'].astype('int64')

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    22
889    26
890    32
Name: Age, Length: 891, dtype: int64

In [210]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [234]:
a = (tain_df['sex']=='male').sum()

NameError: name 'rain_df' is not defined

In [235]:
a = (train_df['Sex']=='male').sum()

In [236]:
a

577

In [255]:
b = (train_df['Sex']).value_counts()

In [256]:
b

male      577
female    314
Name: Sex, dtype: int64

In [257]:
c = (train_df['Pclass']).value_counts()

In [258]:
c

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [263]:
d = (train_df['Fare'] and ['Sex']=='male').mean()

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [262]:
d

32.204207968574636

In [264]:
d = train_df[train_df['Sex'] == 'male']['Fare'].mean()

In [265]:
d

25.523893414211443

In [282]:
e = (train_df['Survived']).value_counts()

In [286]:
e

0    549
1    342
Name: Survived, dtype: int64